## pandas biblioteca

In [272]:
# importando biblioteaca
import pandas as pd # pandas agora tem o nome de pd
# ele vai ler o arquivo conforme a seu formato read_nome do formato ex: read_excel,read_html,read_clipboard
# então melhor saber que formato se encontra o arquivo   
# ctrl + c = copia; ctrl + v = cola;                                
df = pd.read_csv(r"C:\Users\user\Desktop\grafico\Athlete\athlete_events.csv") # de ctrl + c no local do arq e cole dentro das aspas
# o r serve para não dar error 
# .head() sem  numero mostra 5 linhas 
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [56]:
#  mas ele pode mostrar a quatidade de linhas que você quiser
df.head(0)
# como você pode ver o titulo esta em ingles, mas tem como mudar isso

Empty DataFrame
Columns: [ID, Name, Sex, Age, Height, Weight, Team, NOC, Games, Year, Season, City, Sport, Event, Medal]
Index: []

In [57]:
#  NOC = Sigla( National Olympic Committee) traduzido = Comitês Olímpicos Nacionais (CON)
 
dif = df.rename(columns={'Name':'Nome','Sex':"Sexo","Age":'Idade','Height':"Peso","Weight":'Altura',"Team":'Time','NOC':"CON","Games":'Jogos',"Year":'Ano','Season':"Temporada","City":'Cidade','Sport':"Esporte",'Event':"Evento","Medal":'Medalha'}) 
# caso eu queira que o titulo continue em português  eu coloco depois da chaves }, inplace = True
dif.head()

,ID,Nome,Sexo,Idade,Peso,Altura,Time,CON,Jogos,Ano,Temporada,Cidade,Esporte,Evento,Medalha
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [58]:
# e tambem se você quiser te como pegar uma coluna especifaca
altura = df["Weight"].head(10)
altura

# link da kaggle:
# https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results

0    80.0
1    60.0
2     NaN
3     NaN
4    82.0
5    82.0
6    82.0
7    82.0
8    82.0
9    82.0
Name: Weight, dtype: float64

In [149]:
# a diferença de df e altura é que df é DataFrame e altura uma Series
type(df)

pandas.core.frame.DataFrame

In [150]:
type(altura)

pandas.core.series.Series

In [62]:
# agora caso queira mais de uma coluna
altura2 = df[['Weight','Height']].head() # coloque mais um colchte , o nome da outra coluna
altura2

   Weight  Height
0    80.0   180.0
1    60.0   170.0
2     NaN     NaN
3     NaN     NaN
4    82.0   185.0

## usando .loc

In [68]:
#  localizando pegando uma coluna especifica
df.loc[1]

ID                                   2
Name                          A Lamusi
Sex                                  M
Age                                 23
Height                             170
Weight                              60
Team                             China
NOC                                CHN
Games                      2012 Summer
Year                              2012
Season                          Summer
City                            London
Sport                             Judo
Event     Judo Men's Extra-Lightweight
Medal                              NaN
Name: 1, dtype: object

In [69]:
# pode ser qualquer uma
df.loc[2]

ID                              3
Name          Gunnar Nielsen Aaby
Sex                             M
Age                            24
Height                        NaN
Weight                        NaN
Team                      Denmark
NOC                           DEN
Games                 1920 Summer
Year                         1920
Season                     Summer
City                    Antwerpen
Sport                    Football
Event     Football Men's Football
Medal                         NaN
Name: 2, dtype: object

In [84]:
# podendo pegar mais de uma, mas nesse caso seria melhor o head()
 df.loc[0:2]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN

In [87]:
# como de se esperar tem como pular de um em um
df.loc[0:2:2]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN

In [363]:
# como pegar uma informação especifica, como pegar linhas que tem apenas um time. pra isso o loc[]
Chineses = df['Team'] == 'China'
df.loc[Chineses].head() # pronto agora você pode focar em um time especifico

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
1072,602,Abudoureheman,M,22.0,182.0,75.0,China,CHN,2000 Summer,2000,Summer,Sydney,Boxing,Boxing Men's Middleweight,NaN
2611,1463,Ai Linuer,M,25.0,160.0,62.0,China,CHN,2004 Summer,2004,Summer,Athina,Wrestling,"Wrestling Men's Lightweight, Greco-Roman",NaN
2612,1464,Ai Yanhan,F,14.0,168.0,54.0,China,CHN,2016 Summer,2016,Summer,Rio de Janeiro,Swimming,Swimming Women's 200 metres Freestyle,NaN

In [368]:
# você tem que usar o loc nessa situação para mostrar em grafico
Chineses.head()

0     True
1     True
2    False
3    False
4    False
Name: Team, dtype: bool

In [ ]:
# e fazer um pouco mais, mas caso queira apenas ver todas as colunas com chineses há como 
df[]

In [93]:
# e pra ser mais especifico você pode pegar as colunas tambem
df.loc[Chineses,['City','Sport','Age','Team']] #agora voce pode ver

                  City       Sport   Age   Team
0            Barcelona  Basketball  24.0  China
1               London        Judo  23.0  China
1072            Sydney      Boxing  22.0  China
2611            Athina   Wrestling  25.0  China
2612    Rio de Janeiro    Swimming  14.0  China
...                ...         ...   ...    ...
270443          London    Football   NaN  China
270444  Rio de Janeiro  Basketball  20.0  China
270445     Los Angeles   Athletics  28.0  China
270559  Rio de Janeiro    Swimming  26.0  China
270822     Los Angeles  Volleyball  21.0  China

[4975 rows x 4 columns]

In [132]:
# codigo de completo
df.loc[df["Sex"]=='M',["Age","Height","Weight","Sex"]]
# sem guardar o df['coluna'] numa varivel ficara assim,ou seje, fique mais facil

         Age  Height  Weight Sex
0       24.0   180.0    80.0   M
1       23.0   170.0    60.0   M
2       24.0     NaN     NaN   M
3       34.0     NaN     NaN   M
10      31.0   188.0    75.0   M
...      ...     ...     ...  ..
271111  29.0   179.0    89.0   M
271112  27.0   176.0    59.0   M
271113  27.0   176.0    59.0   M
271114  30.0   185.0    96.0   M
271115  34.0   185.0    96.0   M

[196594 rows x 4 columns]

In [137]:
# pegando informaçâo de uma linha e coluna especifica
df.loc[5,"Sex"]

'F'

In [114]:
choin=df.loc[Chineses] 
choin.shape # pronto agora eu sei a quantidade de chineses no grafico

(4975, 15)

In [115]:
df.shape

(271116, 15)

In [146]:
print(df.info())
print()
print(choin.info()) # e ate a quantidade de medalhas

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4975 entries, 0 to 270822
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      4975 non-null   int64
 1   Name    4975 non-null   object
 2   Sex     4975 non-null   object
 3   Age     4950 non-null   float64
 4   Height  4720 non-null   float64
 5   Weight  4722 non-null   float64
 6   Team    4975 non-null   object
 7   NOC     4975 non-null   object
 8   Games   4975 non-null   object
 9   Year    4975 non-null   int64
 10  Season  4975 non-null   object
 11  City    4975 non-null   object
 12  Sport   4975 non-null   object
 13  Event   4975 non-null   object
 14  Medal   901 non-null    object
dtypes: float64(3), int64(2), object(10)
memory usage: 621.9+ KB
None

In [157]:
# se isnull = True então significa que há valores vazios
df.isnull().head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True
2,False,False,False,False,True,True,False,False,False,False,False,False,False,False,True
3,False,False,False,False,True,True,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True

In [164]:
# conta os valores de uma coluna especifica
df['Sex'].value_counts()
# dando pra você a quantidade de vezes que um dado se repete e dizendo o seu type

M    196594
F     74522
Name: Sex, dtype: int64

In [166]:
# count conta, unique diz quantos dados sem repetir existem, top o mais repetido e 
# a frequencia com que ele aparece, name nome da column, dtypt type.
df['Sex'].describe()

count     271116
unique         2
top            M
freq      196594
Name: Sex, dtype: object

In [180]:
# retira linhas com valores nulos
SemValuesNaN=df.dropna()

In [181]:
# uma maneira de se fazer as coisas, mas não recomendo
SemValuesNaN.shape

(30181, 15)

In [182]:
# ate porque tira bastante coisa 
df.shape

(271116, 15)

## alterando colunas

In [186]:
# agora drop
dafao = df.drop(["City","ID","Season"],axis=1) # lembrando que se quiser há como colocar inplace = True
dafao.head() # para salvar a alteração

,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Sport,Event,Medal
0,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Basketball,Basketball Men's Basketball,NaN
1,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Judo,Judo Men's Extra-Lightweight,NaN
2,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Football,Football Men's Football,NaN
3,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Speed Skating,Speed Skating Women's 500 metres,NaN

In [189]:
dof = df 
dof.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [193]:
# lidando com dados NaN/Faltantes
# caso você use machine learning preencher dados NaN é essencial
dof.fillna('preenchido').head()
# se você não espeficicar a coluna você preenchra tudo

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24,180,80,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,preenchido
1,2,A Lamusi,M,23,170,60,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,preenchido
2,3,Gunnar Nielsen Aaby,M,24,preenchido,preenchido,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,preenchido
3,4,Edgar Lindenau Aabye,M,34,preenchido,preenchido,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21,185,82,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,preenchido

In [205]:
# contando valores nulos true significa que ha valores nulos
dof['Age'].isnull().value_counts()

False    261642
True       9474
Name: Age, dtype: int64

In [216]:
la=dof['Age'].mean()
round(la)

26

In [227]:
dof['Age'].fillna(round(la))

0         24.0
1         23.0
2         24.0
3         34.0
4         21.0
          ...
271111    29.0
271112    27.0
271113    27.0
271114    30.0
271115    34.0
Name: Age, Length: 271116, dtype: float64

In [230]:
dof['Age'].fillna(round(la),inplace=True)

In [283]:
display(dof.head())

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,175.0,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,175.0,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [231]:
# como você pode ver não há valores nulos
display(dof['Age'].isnull().value_counts())

False    271116
Name: Age, dtype: int64

In [245]:
# alguns comando sao ótimos e não devem ser esquecidos esse é o caso do value_counts()
dof["Height"].isnull().value_counts() # aparentemente existem  pessoas com vergonha 
# da sua altura e não apenas da idade
# ainda bem que existe o .fillna()

False    210945
True      60171
Name: Height, dtype: int64

In [246]:
dof["Height"].mean()

175.33896987366376

In [251]:
MeanHeight = dof["Height"].mean()
round(MeanHeight)

175

In [253]:
dof["Height"].fillna(round(MeanHeight),inplace=True)

In [285]:
dof["Height"].isnull().value_counts() # melhor agora não?

False    271116
Name: Height, dtype: int64

In [273]:
# outra maneira de se contar dados faltantes
nulo = df.isnull().sum()
nulo
# quase esqueci
# medalhas e o dado menos preechido

ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight     62875
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     231333
dtype: int64

In [287]:
nuloPercent = (nulo / len(df["ID"]))
nuloPercent

ID        0.000000
Name      0.000000
Sex       0.000000
Age       0.034944
Height    0.221938
Weight    0.231912
Team      0.000000
NOC       0.000000
Games     0.000000
Year      0.000000
Season    0.000000
City      0.000000
Sport     0.000000
Event     0.000000
Medal     0.853262
dtype: float64

In [289]:
# agora em porcentagem
nuloPercent = (nulo / len(df["ID"]))*100
round(nuloPercent,1)

ID         0.0
Name       0.0
Sex        0.0
Age        3.5
Height    22.2
Weight    23.2
Team       0.0
NOC        0.0
Games      0.0
Year       0.0
Season     0.0
City       0.0
Sport      0.0
Event      0.0
Medal     85.3
dtype: float64

In [297]:
df["Weight"].isnull().value_counts() # tenho quase certeza de que os mesmos 
# que não deram sua idade e altura tambem sao os mesmos que não deram o seu peso

False    208241
True      62875
Name: Weight, dtype: int64

In [298]:
MeanWeight=dof["Weight"].mean()
round(MeanWeight,1) # sinceramente é melhor arredondar

70.8

In [291]:
dof["Weight"].fillna(round(MeanWeight),inplace=True)

## fileira is
- null,nan,~,notnull,any e axis

In [299]:
# pronto melhor agora
dof["Weight"].isnull().value_counts()

False    271116
Name: Weight, dtype: int64

In [302]:
dof["Medal"].isna().value_counts()

True     231333
False     39783
Name: Medal, dtype: int64

In [304]:
dof["Medal"].isna()

0          True
1          True
2          True
3         False
4          True
          ...
271111     True
271112     True
271113     True
271114     True
271115     True
Name: Medal, Length: 271116, dtype: bool

In [305]:
dof["Medal"].isnull()

0          True
1          True
2          True
3         False
4          True
          ...
271111     True
271112     True
271113     True
271114     True
271115     True
Name: Medal, Length: 271116, dtype: bool

In [303]:
# não tem diferença usar isna() ou isnull()
dof["Medal"].isnull().value_counts()

True     231333
False     39783
Name: Medal, dtype: int64

In [307]:
# mesma coisa porem  ao contrario
dof["Medal"].notnull()

0         False
1         False
2         False
3          True
4         False
          ...
271111    False
271112    False
271113    False
271114    False
271115    False
Name: Medal, Length: 271116, dtype: bool

In [309]:
# a diferença é que false é para valores ja preenchidos
dof["Medal"].notnull().value_counts()

False    231333
True      39783
Name: Medal, dtype: int64

In [311]:
# o tio na frente faz com que a função a frente fique ao contrario
~dof["Medal"].notnull()

0          True
1          True
2          True
3         False
4          True
          ...
271111     True
271112     True
271113     True
271114     True
271115     True
Name: Medal, Length: 271116, dtype: bool

In [313]:
# e se você usa-lo(~) no value_counts() dara valor negativo 
~dof["Medal"].notnull().value_counts()

False   -231334
True     -39784
Name: Medal, dtype: int64

In [335]:
# caso va usar axis e any você tera que o colocar entre colchetes para mostrar em forma de grafico
df[df.isnull().any(axis=1)].head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [347]:
# == 0 ou 1  define se valores NaN vão ou não aparecer com 1 sendo Sim e 0 Não  
df[df.isnull().any(axis=1) == 0].head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
40,16,Juhamatti Tapio Aaltonen,M,28.0,184.0,85.0,Finland,FIN,2014 Winter,2014,Winter,Sochi,Ice Hockey,Ice Hockey Men's Ice Hockey,Bronze
41,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Individual All-Around,Bronze
42,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Team All-Around,Gold
44,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Horse Vault,Gold
48,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Pommelled Horse,Gold

In [361]:
# mostra valores nulos no grafico presentes na mesma linha,
# o maximo de valores nulos encotrados em uma linha sao 4
df[df.isnull().sum(axis=1) == 4].head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
147,54,Mohamed Jamshid Abadi,M,NaN,NaN,NaN,Iran,IRI,1948 Summer,1948,Summer,London,Boxing,Boxing Men's Heavyweight,NaN
152,58,Georgi Abadzhiev,M,NaN,NaN,NaN,Bulgaria,BUL,1924 Summer,1924,Summer,Paris,Cycling,"Cycling Men's Road Race, Individual",NaN
153,58,Georgi Abadzhiev,M,NaN,NaN,NaN,Bulgaria,BUL,1924 Summer,1924,Summer,Paris,Cycling,"Cycling Men's Road Race, Team",NaN
212,102,Sayed Fahmy Abaza,M,NaN,NaN,NaN,Egypt,EGY,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
213,102,Sayed Fahmy Abaza,M,NaN,NaN,NaN,Egypt,EGY,1928 Summer,1928,Summer,Amsterdam,Football,Football Men's Football,NaN

###  DataFrame e Dicio

In [239]:
# criando dataframe e dicionario
import pprint # pprint alinha as coisas
alunos = {"Nome":["Laura","Lauricio","Marcelo","Mariana","Clark Quente","Lex Luter Soares"],
         "Nota":[7, 6, 4.5, 6.9, 8, 11],
          "Media":6.0,
         "Aprovado":["Sim","Sim","Não","Sim","Sim","COMO?!?"]}
print(alunos)
print('-------------------------------------\n')
pprint.pprint(alunos)

{'Nome': ['Laura', 'Lauricio', 'Marcelo', 'Mariana', 'Clark Quente', 'Lex Luter Soares'], 'Nota': [7, 6, 4.5, 6.9, 8, 11], 'Media': 6.0, 'Aprovado': ['Sim', 'Sim', 'Não', 'Sim', 'Sim', 'COMO?!?']}
-------------------------------------

{'Aprovado': ['Sim', 'Sim', 'Não', 'Sim', 'Sim', 'COMO?!?'],
 'Media': 6.0,
 'Nome': ['Laura',
          'Lauricio',
          'Marcelo',
          'Mariana',
          'Clark Quente',
          'Lex Luter Soares'],
 'Nota': [7, 6, 4.5, 6.9, 8, 11]}

In [233]:
# como você pode ver se a Nota for menor que 6 ele nao sera aprovado 
Alunosdf = pd.DataFrame(alunos)
Alunosdf

               Nome  Nota  Media Aprovado
0             Laura   7.0    6.0      Sim
1          Lauricio   6.0    6.0      Sim
2           Marcelo   4.5    6.0      Não
3           Mariana   6.9    6.0      Sim
4      Clark Quente   8.0    6.0      Sim
5  Lex Luter Soares  11.0    6.0  COMO?!?

In [234]:
print(Alunosdf,"(lex luter na dando infartando os professores)[isso ainda na escolhina]")

               Nome  Nota  Media Aprovado
0             Laura   7.0    6.0      Sim
1          Lauricio   6.0    6.0      Sim
2           Marcelo   4.5    6.0      Não
3           Mariana   6.9    6.0      Sim
4      Clark Quente   8.0    6.0      Sim
5  Lex Luter Soares  11.0    6.0  COMO?!? (lex luter na dando infartando os professores)[isso ainda na escolhina]

In [25]:
# .shape olha o quantidade de linhas e colunas.
Alunosdf.shape

(6, 4)

In [236]:
# somando
nota_classe=Alunosdf['Nota'].sum()
nota_classe
# o comando sum é bom facilita as coisas

43.4

In [242]:
Alunosdf.value_counts()

Nome              Nota  Media  Aprovado
Mariana           6.9   6.0    Sim         1
Marcelo           4.5   6.0    Não         1
Lex Luter Soares  11.0  6.0    COMO?!?     1
Lauricio          6.0   6.0    Sim         1
Laura             7.0   6.0    Sim         1
Clark Quente      8.0   6.0    Sim         1
dtype: int64

In [27]:
pe=Alunosdf.describe()
round(pe)

       Nota  Media
count   6.0    6.0
mean    7.0    6.0
std     2.0    0.0
min     4.0    6.0
25%     6.0    6.0
50%     7.0    6.0
75%     8.0    6.0
max    11.0    6.0

In [28]:
pe

            Nota  Media
count   6.000000    6.0
mean    7.233333    6.0
std     2.187845    0.0
min     4.500000    6.0
25%     6.225000    6.0
50%     6.950000    6.0
75%     7.750000    6.0
max    11.000000    6.0

In [46]:
# mais um comando legal .info() basicamente ele da informações
Alunosdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nome      6 non-null      object
 1   Nota      6 non-null      float64
 2   Media     6 non-null      float64
 3   Aprovado  6 non-null      object
dtypes: float64(2), object(2)
memory usage: 320.0+ bytes

### comandos dahora de dicionarios

In [36]:
alunos.keys()

dict_keys(['Nome', 'Nota', 'Media', 'Aprovado'])

In [38]:
alunos.values()

dict_values([['Laura', 'Lauricio', 'Marcelo', 'Mariana', 'clark Quente', 'Lex Luter Soares'], [7, 6, 4.5, 6.9, 8, 11], 6.0, ['Sim', 'Sim', 'Não', 'Sim', 'Sim', 'COMO?!?']])

In [39]:
alunos.items()

dict_items([('Nome', ['Laura', 'Lauricio', 'Marcelo', 'Mariana', 'clark Quente', 'Lex Luter Soares']), ('Nota', [7, 6, 4.5, 6.9, 8, 11]), ('Media', 6.0), ('Aprovado', ['Sim', 'Sim', 'Não', 'Sim', 'Sim', 'COMO?!?'])])

### pandas e numpy
- Series e Array

In [11]:
# ele mostra tudo da lista em apenas uma coluna
obj = pd.Series([1,2,3,9,8,7,6,5,4])
obj

0    1
1    2
2    3
3    9
4    8
5    7
6    6
7    5
8    4
dtype: int64

In [240]:
# como você pode ver não tem coluna
obj.shape

(9,)

In [36]:
import numpy as np
# dica: se no seu deu errado é porque o numero de objetos na 1º tupla não é o mesmo na 2º
aray = np.array([(2,4,6,8,9,123),(1,3,5,7,9,594)]) # bi-dimensional  
aray2 = np.array([("limão"),("com marcuja")]) # bi-dimensional str
aray1 = np.array([1,2,3,4,5,6,7,8,9]) # uni-dimendsinal 
print(aray)
print(aray2)
print(aray1)

[[  2   4   6   8   9 123]
 [  1   3   5   7   9 594]]
['limão' 'com marcuja']
[1 2 3 4 5 6 7 8 9]

In [42]:
# usando pandas e numpy juntos
obj2 = pd.Series(aray1) 
print(obj2)
# obj3 = pd.Series(aray), tome cuidado pois ha limitações se usado com um array bi-dimen.
# print(obj3) dara error

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [45]:
# como pde ver faz o mesmo que o array do numpy mas continua sendo em uma dimensao
obj3 = pd.array(aray1)
print(obj3)

<IntegerArray>
[1, 2, 3, 4, 5, 6, 7, 8, 9]
Length: 9, dtype: Int32